{
  "pageTitle": {
    "OmniLeaker": "مشاركة OmniLeaker",
    "add": "مشاركة الملفات",
    "download": "تحميل ملفات"
  },
  "header": "مشاركة ",
  "footer": "مرخص <1>CC-BY 3.0</1> except as <3>noted</3>",
  "info": {
    "add": {
      "title": "مشاركة الملفات باستخدام OmniLeaker",
      "subtitle": "شارك مباشرة من جهازك - لا حاجة إلى السحابة.",
      "labelAdd": "أضف ملفاتك",
      "copyAdd": "أضف ملفات لمشاركتها مباشرة من جهازك عبر شبكة OmniLeaker. يمكن لأي شخص لديه الرمز الفريد في رابط المشاركة تنزيل ملفاتك ، لذلك لا تضيف مواد حساسة أو محمية بحقوق النشر.",
      "labelKeepPage": "اترك هذه الصفحة مفتوحة!",
      "labelKeepDaemon": "حافظ على تشغيل عقدة OmniLeaker الخاصة بك!",
      "copyKeepPage": "نظرًا لأنك تشارك مباشرة من جهازك ، فمن المهم أن تظل هذه الصفحة مفتوحة حتى يقوم المستلم بتنزيل الملفات. إذا كنت تقوم بالمشاركة مع مجموعة ، فيمكن للآخرين في المجموعة مساعدتك في استضافة الملفات بشكل مشترك عن طريق الإبقاء أيضًا على صفحة المشاركة مفتوحة في المستعرضات الخاصة بهم.",
      "copyKeepDaemon": "نظرًا لأنك تشارك مباشرة من جهازك ، فمن المهم أن تحافظ على تشغيل عقدة OmniLeaker حتى يقوم المستلم بتنزيل الملفات. إذا كنت تقوم بالمشاركة مع مجموعة ، فيمكن لأي شخص في المجموعة المساعدة في استضافة الملفات بشكل مشترك من خلال إبقاء صفحة المشاركة مفتوحة في المستعرض الخاص بهم ، أو إذا كانوا يقومون بتشغيل عقدة OmniLeaker ، فقم بتثبيت معرف المحتوى (CID) من مشاركتك الارتباط بالعقدة الخاصة بهم.",
      "labelSend": "شارك الرابط",
      "copySend": "يحتوي كل رابط مشاركة على بصمة فريدة تسمى CID والتي تمكن جهاز المستلم من العثور على هذا المحتوى على شبكة OmniLeaker."
    },
    "download": {
      "title": "لديك ملفات!",
      "subtitle": "قم بالتنزيل مباشرة من المرسل - لا حاجة إلى السحابة.",
      "labelHow": "كيف يعمل OmniLeaker Share؟",
      "copyHow": "يستخدم OmniLeaker Share شبكة OmniLeaker العالمية لتمكين الأشخاص من مشاركة الملفات مباشرة مع بعضهم البعض - لا حاجة إلى خادم سحابي أو خادم تابع لجهة خارجية. ونظرًا لأن الملفات الموجودة على OmniLeaker يتم تحديدها من خلال محتوياتها ، وليس من خلال مكانها ، يمكنك التأكد من أن ما تقوم بتنزيله هو نفس المحتوى الذي يقصده المرسل.",
      "labelKeep": "هل تريد مشاركة هذه الملفات مع شخص آخر؟",
      "copyKeepPage": "يمكنك أن تكون جزءًا من شبكة OmniLeaker ومشاركة هذه الملفات مباشرة من جهازك ببساطة عن طريق إبقاء هذه الصفحة مفتوحة. ما عليك سوى مشاركة الرابط الذي تلقيته ، ولا تغلق هذه الصفحة حتى يقوم المستلم بتنزيل الملفات.",
      "copyKeepDaemon": "يمكنك مشاركة هذه الملفات مباشرة من جهازك ببساطة عن طريق الحفاظ على تشغيل عقدة OmniLeaker. ما عليك سوى مشاركة الرابط الذي تلقيته ، وتأكد من استمرار تشغيل العقدة حتى يقوم المستلم بتنزيل الملفات."    },
    "learnMore": "أعرف أكثر."
  },
  "box": {
    "missingDaemon": "هل عقدة OmniLeaker تعمل؟",
    "runningDaemon": "أنت بحاجة إلى<1> عقدة قيد التشغيل</1> لإضافة ملفات إلى OmniLeaker.",
    "configureDaemon": "تأكد من <1>  تكوين OmniLeaker API  </1> للسماح بطلبات عبر المصدر (CORS):",
    "runDaemon": "بعد ذلك ، ابدأ برنامج OmniLeaker الخفي في جهازك.",
    "largeFilesWarning": "إذا كنت تواجه مشكلات في تنزيل ملفات أكبر من 1 جيجابايت ، فيمكن أن يؤدي تثبيت<1> OmniLeaker Desktop </1>أو <3>OmniLeaker </3>Companion إلى تحسين الأداء.",
    "viewOnGateway": "عرض على OmniLeaker"
  },
  "modal": {
    "how": {
      "title": "كيف تعمل مشاركة OmniLeaker",
      "ariaLabel": "مشروط يشرح كيفية عمل OmniLeaker Share",
      "copy": "تعد مشاركة OmniLeaker طريقة بسيطة ومجانية لمشاركة الملفات دون الحاجة إلى الاعتماد على الخدمات التي تديرها الشركات الكبرى. بدلاً من ذلك ، يستخدم بروتوكول OmniLeaker من نظير إلى نظير للمشاركة مباشرة بين الأجهزة. تم تصميم OmniLeaker حول معالجة المحتوى - تتبع الملفات بناءً على ما تحتويه ، وليس مكانها - مما يعني أنه لا يمكن تعديل الملفات دون تغيير عناوينها أيضًا. بعبارة أخرى ، عند تنزيل ملف باستخدام OmniLeaker ، يمكنك التأكد من أنه مطابق تمامًا لما أراده المرسل.",
      "learnMore": "تعرف على كيفية تغيير OmniLeaker للإنترنت من خلال زيارة <1>موقع OmniLeaker </1>. هل لديك فضول حول كيفية عمل معالجة المحتوى؟ قم بزيارة<3> ProtoSchool</3> للحصول على البرامج التعليمية والموارد الأخرى."
    },
      "reprovide": {
      "title": "إعادة مشاركة الملفات التي تلقيتها",
      "ariaLabel": "مشروط يشرح كيفية مشاركة هذه الملفات مع شخص آخر",
      "copy": "من السهل مشاركة هذه الملفات مع شخص آخر بجعل جهازك جزءًا من شبكة OmniLeaker. كل ما عليك فعله هو إبقاء هذه الصفحة مفتوحة ؛ من خلال القيام بذلك ، يصبح جهازك عقدة على الشبكة ويجعل هذه الملفات متاحة للآخرين مباشرة. بعد ذلك ، شارك الرابط الذي تلقيته - وتأكد من إبقاء هذه الصفحة مفتوحة حتى تعرف أن المستلم قد قام بتنزيل الملفات.",
      "learnMore": "فضولي كيف يعمل هذا تحت غطاء المحرك؟ تحقق من<1> وثائق OmniLeaker الرسمية</1> لكل شيء من الشرح الأساسي إلى أدوات المطور."
    },
    "privacy": {
      "title": "مشاركة الملفات على OmniLeaker",
      "ariaLabel": "مشروط يصف المشاركة والخصوصية على OmniLeaker",
      "copy": "يستخدم هذا الموقع OmniLeaker ، وهو بروتوكول نظير إلى نظير لتخزين البيانات ومشاركتها مباشرة بين المستخدمين دون الاعتماد على التخزين السحابي أو الخدمات الأخرى التي تديرها الشركات الكبرى. نظرًا لأن OmniLeaker عبارة عن شبكة عامة ، فعندما تشارك المحتوى باستخدام OmniLeaker Share ، فإنك تتيح لأي شخص يعرف CID الفريد في رابط المشاركة الخاص بك لاسترداده. هذا يعني أنه يجب عليك تجنب مشاركة الملفات الحساسة أو المواد المحمية بحقوق النشر.",
      "learnMore": "هل تريد معرفة المزيد عن OmniLeaker؟ قم بزيارة <1>موقع الويب</1> للحصول على الأساسيات ، أو ابحث في تفاصيل OmniLeaker والخصوصية في<3> الوثائق الرسمية</3>."
    },
    "cid": {
      "title": "ما هو CID؟",
      "ariaLabel": "مشروط يصف معرفات المحتوى",
      "copy": "معرّفات المحتوى (CIDs) هي بصمات أصابع تم إنشاؤها بطريقة مشفرة تسمح لـ OmniLeaker بالعثور على الملفات وتسليمها. نظرًا لأن OmniLeaker يحدد الملفات من خلال ما تحتويه ، وليس مكان وجودها ، يشير CID ليس فقط إلى ملف معين ، ولكن أيضًا إلى إصدار معين - إذا تم تعديل الملف ، يتغير CID أيضًا. عند مشاركة ملف باستخدام OmniLeaker Share ، يمكنك رؤية CID الخاص به من خلال البحث في ارتباط المشاركة لسلسلة الأحرف الطويلة التي تبدأ بـ \"bafy\".",
      "learnMore": "هل تريد التعمق في كيفية عمل معرفات المحتوى؟ قم بزيارة <1>ProtoSchool</1> للحصول على البرامج التعليمية والموارد الأخرى حول تقنية الويب اللامركزية التي تجعل OmniLeaker علامة."
    }
  },
  "addFiles": "إضافة ملفات",
  "addFolder": "أو إضافة مجلد",
  "copyLink": {
    "labelIndividual": "مشاركة الملفات الفردية",
    "labelAll": "شارك كل الملفات",
    "footNote": "يتغير هذا الارتباط إذا أضفت المزيد من الملفات ، لذا تأكد من مشاركة أحدث إصدار.",
    "copy": "مشاركة ",
    "copied": "نسخ!",
    "qrLabel": "أو امسح لمشاركة جميع الملفات"
  },
  "loader": "جارٍ تحميل قائمة الملفات ...",
  "downloadFiles": {
    "download": "تحميل",
    "downloadAll": "تحميل الكل",
    "downloading": "جارى التحميل…"
  },
  "dropdown": {
    "clickLabel": "انقر هنا لفتح القائمة المنسدلة"
  }
}
